Show / Hide Table of Contents
Class StagesLoading
Stages loading
Inheritance
System.Object
OpenObject
StagesLoading
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.Load
Assembly: IdeaRS.OpenModel.dll
Syntax
public class StagesLoading : OpenObject
Constructors
Improve this Doc   View Source
StagesLoading()
Constructor
Declaration
public StagesLoading()
Properties
Improve this Doc   View Source
CssComponentLoad
Cross-section component loading
Declaration
public List<CssComponentLoading> CssComponentLoad { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CssComponentLoading>
Improve this Doc   View Source
CssEffectType
Type of effects in cross-section component
Declaration
public CssEffectType CssEffectType { get; set; }
Property Value
 Type |  Description
 CssEffectType
Improve this Doc   View Source
PermanentLoad
Permanent loading
Declaration
public List<StageLoading> PermanentLoad { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<StageLoading>
Improve this Doc   View Source
PrestressInputType
Type of input of prestressing
Declaration
public PrestressInputType PrestressInputType { get; set; }
Property Value
 Type |  Description
 PrestressInputType
Improve this Doc   View Source
PrestressLoad
Prestress loading
Declaration
public List<PrestressLoading> PrestressLoad { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PrestressLoading>
Improve this Doc   View Source
TendonComponentLoad
Tendon component loading
Declaration
public List<TendonComponentLoading> TendonComponentLoad { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<TendonComponentLoading>
 Improve this Doc
 View Source